gcoonrod/stm32-shift-display/firmware/src/main.cpp
#include <Arduino.h>
#include <ShiftDisplay.h>
#include <ShiftDisplayFSM.h>
#include <STM32RTC.h>
#include <AceButton.h>
#include <SerialCommands.h>
#include <stdlib.h>
#include "header.h"

#define SERIAL_COMMANDS_DEBUG

using namespace ace_button;

#define SER PA3
#define SRCLK PA4
#define SRCLRB PA1
#define RCLK PA2
#define OEB PA0

/**
 * ~OE must not be one of the shift-register control pins, and none of them may
 * alias another.
 *
 * ~OE shares GPIOA with all four, and the driver reaches its pins through BSRR
 * words composed from their masks. If a pin define were ever edited to collide
 * with OEB, those words would reach across the brightness timer's pin -- and
 * once the display engine replays them from a DMA buffer there is nothing in
 * the instruction stream to show it. The failure would look like a display that
 * dims wrongly, not like a bug.
 *
 * This catches an alias at build time. ShiftDisplay::begin() catches the subtler
 * case of two distinct pin numbers landing on the same port bit, which only the
 * variant's pin map knows.
 */
static_assert(OEB != SER && OEB != SRCLK && OEB != SRCLRB && OEB != RCLK,
              "The output-enable pin collides with a shift-register control pin");
static_assert(SER != SRCLK && SER != SRCLRB && SER != RCLK &&
                  SRCLK != SRCLRB && SRCLK != RCLK && SRCLRB != RCLK,
              "Two shift-register control pins are assigned to the same pin");

/**
 * User LEDs. The positional names below are how the LEDs sit on the board; note
 * that they run opposite to the schematic's D-numbering, which is a trap worth
 * keeping in mind when cross-referencing:
 *
 *   LED_TOP  PB8  net /LED3  schematic D3  -> AM indicator (12-hour mode only)
 *   LED_MID  PB7  net /LED2  schematic D2  -> 12-hour mode active
 *   LED_BOT  PB6  net /LED1  schematic D1  -> alarm armed (steady) / firing (blink)
 *
 * All three are active high: the cathodes tie to GND through their resistors.
 */
#define LED_BOT PB6
#define LED_MID PB7
#define LED_TOP PB8
#define BTN_SET PB5
#define BTN_PLUS PB4
#define BTN_MINUS PB3

// Utility types
enum ButtonState
{
  PRESSED,
  RELEASED,
  CLICKED,
  LONG_PRESSED,
  REPEATED,
  UNCHANGED
};

ShiftDisplay display(SER, SRCLK, SRCLRB, RCLK, OEB);
ShiftDisplayFSM stateMachine;

char serial_command_buffer_[32];
SerialCommands serial_commands_(&Serial, serial_command_buffer_, sizeof(serial_command_buffer_), "\r\n", " ");
void cmd_unrecognized(SerialCommands *sender, const char *cmd);
void cmd_test(SerialCommands *sender);
void cmd_set_time(SerialCommands *sender);
void cmd_get_time(SerialCommands *sender);
void cmd_set_offset(SerialCommands *sender);
void cmd_get_offset(SerialCommands *sender);
void cmd_get_mode(SerialCommands *sender);
void cmd_set_mode(SerialCommands *sender);
void cmd_get_alarm(SerialCommands *sender);
void cmd_set_alarm(SerialCommands *sender);
void cmd_alarm_enable(SerialCommands *sender);
void cmd_get_leds(SerialCommands *sender);
void cmd_get_bright(SerialCommands *sender);
void cmd_set_bright(SerialCommands *sender);
void cmd_get_disp(SerialCommands *sender);
void cmd_get_backup(SerialCommands *sender);
#ifdef SHIFT_SWEEP
void cmd_set_nops(SerialCommands *sender);
void cmd_set_pattern(SerialCommands *sender);
#endif
#ifdef SHIFT_ENGINE_VERIFY
void cmd_wave_verify(SerialCommands *sender);
void cmd_wave_level(SerialCommands *sender);
void cmd_wave_dump(SerialCommands *sender);
void cmd_wave_rate(SerialCommands *sender);
#endif
void cmd_set_disp(SerialCommands *sender);

SerialCommand cmd_test_("TEST", cmd_test);
SerialCommand cmd_set_time_("ST", cmd_set_time);
SerialCommand cmd_get_time_("GT", cmd_get_time);
SerialCommand cmd_set_offset_("SO", cmd_set_offset);
SerialCommand cmd_get_offset_("GO", cmd_get_offset);
SerialCommand cmd_get_mode_("GM", cmd_get_mode);
SerialCommand cmd_set_mode_("SM", cmd_set_mode);
SerialCommand cmd_get_alarm_("GA", cmd_get_alarm);
SerialCommand cmd_set_alarm_("SA", cmd_set_alarm);
SerialCommand cmd_alarm_enable_("AE", cmd_alarm_enable);
SerialCommand cmd_get_leds_("GL", cmd_get_leds);
SerialCommand cmd_get_bright_("GI", cmd_get_bright);
SerialCommand cmd_set_bright_("SI", cmd_set_bright);
SerialCommand cmd_get_disp_("GD", cmd_get_disp);
SerialCommand cmd_set_disp_("SD", cmd_set_disp);
SerialCommand cmd_get_backup_("GB", cmd_get_backup);
#ifdef SHIFT_SWEEP
SerialCommand cmd_set_nops_("SN", cmd_set_nops);
SerialCommand cmd_set_pattern_("TP", cmd_set_pattern);
#endif
#ifdef SHIFT_ENGINE_VERIFY
/* Replays the waveform from the CPU, writing exactly the words and in exactly
   the order the two DMA channels will. Establishes that the buffer is right
   before any peripheral is configured -- debugging a DMA display by eye is hard
   enough without also wondering whether what it replays was ever correct. */
bool wave_verify = false;
SerialCommand cmd_wave_verify_("WV", cmd_wave_verify);
SerialCommand cmd_wave_level_("WL", cmd_wave_level);
SerialCommand cmd_wave_dump_("WD", cmd_wave_dump);
SerialCommand cmd_wave_rate_("WR", cmd_wave_rate);
#endif

STM32RTC &rtc = STM32RTC::getInstance();
DateTimeBuffer_t date_time_buf = {0, 1, RTC_MONTH_JANUARY, 1, 0, 0, 0};
bool time_dirty = true;
int8_t timezoneOffset = -6; // CST

/**
 * Settings that outlive a power cut, held in the backup domain on VBAT.
 *
 * Register budget on the F103C8 is DR1..DR10, and most of it is already spoken
 * for: the core claims DR1 (RTC_BKP_INDEX), DR4 (HID_MAGIC_NUMBER_BKP_INDEX) and
 * DR10 in backup.h, and STM32RTC stores the F1's emulated date across DR6 and
 * DR7 (RTC_BKP_DATE). Writing any of those would corrupt someone else's state --
 * the date one in particular would surface as a clock bug, not a settings bug.
 * DR2, DR3 and DR5 are free.
 */
#define BKP_MAGIC_REG LL_RTC_BKP_DR2
#define BKP_FLAGS_REG LL_RTC_BKP_DR3
#define BKP_ALARM_REG LL_RTC_BKP_DR5
/* Low byte: indicator level, stored as-is. High byte: display level, stored
   offset by one so that zero means "never written".
   
   The low byte shipped first, and the high byte was left as zero. Storing the
   display level raw would make that zero indistinguishable from a deliberate
   level 0 -- the dimmest setting -- so every device already in the field would
   come up looking blank on the first boot after this change. The offset costs a
   byte of arithmetic and avoids resetting the settings that are already there. */
#define BKP_BRIGHT_REG LL_RTC_BKP_DR8
#define BKP_MAGIC_VALUE 0xC10CU

#define FLAG_MODE_12 0x1U
#define FLAG_ALARM_ARMED 0x2U

typedef struct
{
  bool mode12;
  bool alarmArmed;
  uint8_t alarmHour;
  uint8_t alarmMinute;
  uint8_t indicatorLevel; // index into led_gamma
  uint8_t displayLevel;   // index into disp_gamma
} Settings_t;

