gcoonrod/stm32-shift-display/firmware/src/main.cpp
Settings_t settings = {false, false, 7, 0, 4, 5};

// SET gets its own config; see setup_user_btns() for why it must not share
// the repeat-press feature with PLUS/MINUS.
ButtonConfig setButtonConfig;
AceButton btnSet(BTN_SET);
AceButton btnPlus(BTN_PLUS);
AceButton btnMinus(BTN_MINUS);

ButtonState btnSetState = ButtonState::UNCHANGED;
ButtonState btnPlusState = ButtonState::UNCHANGED;
ButtonState btnMinusState = ButtonState::UNCHANGED;

// Values being edited. Copied in when an editor is entered and only written
// through on commit, so backing out discards them.
uint8_t edit_field[3] = {0, 0, 0};
MenuState edit_item = MENU_NONE;

volatile bool alarm_fire_request = false;

#ifdef SHIFT_SWEEP
/**
 * Measurement scaffolding, compiled only into the sweep build.
 *
 * The shift rate has to be established on the assembled board: the parts are
 * 74HC at 3.3 V and the chain is six deep, and the far end is not wired back, so
 * there is no electrical readback. The only instrument is the display itself,
 * which means the test pattern has to make corruption unmistakable.
 *
 * Two patterns, because there are two failure modes. All segments lit exposes a
 * dropped bit. Six distinct digits expose a stream that has shifted -- which the
 * all-lit pattern would hide completely, every digit being identical.
 */
extern volatile uint8_t shift_edge_nops;
uint8_t test_pattern = 0; // 0 = show the clock, 1 = 888888, 2 = 012345
#endif

// What the very first backup-register read returned at boot, captured before
// anything can overwrite it. If settings_load() misreads the magic on a cold
// start it rewrites defaults over the saved values, which destroys them
// permanently -- this is how to tell that apart from the registers themselves
// having been cleared.
uint32_t boot_magic_seen = 0xFFFFFFFFU;
uint32_t boot_flags_seen = 0xFFFFFFFFU;
uint32_t boot_alarm_seen = 0xFFFFFFFFU;
uint32_t boot_bright_seen = 0xFFFFFFFFU;

bool output_en = false;

uint32_t last_activity_ms = 0;

// What was last shifted out, so the display is only re-latched when it changes.
char last_rendered[7] = {0};
uint8_t last_rendered_dp = 0xFF;

#define BLINK_PERIOD_MS 300
#define BREATH_PERIOD_MS 2500

/* PWM_BITS, PWM_MAX_DUTY and PWM_FREQ_HZ moved to header.h: the display engine's
   timer constants are derived from PWM_FREQ_HZ, so it has to be visible to the
   ShiftDisplay library as well as to this file. */

/**
 * Indicator brightness levels, mapped to duty on a gamma curve. Luminous output
 * is linear in duty but perceived lightness is not -- roughly luminance^(1/2.2) --
 * so evenly spaced duty values feel bunched at the bottom and flat at the top.
 * A table beats pow() on a core with no FPU, and at eight entries it costs eight
 * bytes. The lowest entry is floored above the curve's own value so the dimmest
 * setting stays visible rather than reading as a failed LED.
 */
#define LED_LEVELS 8
static const uint16_t led_gamma[LED_LEVELS] = {64, 194, 473, 891, 1456, 2175, 3053, 4095};

/* The same curve for the display, with a higher floor: an indicator only has to
   be visible at its dimmest, whereas the display has to stay readable. */
#define DISP_LEVELS 8
static const uint16_t disp_gamma[DISP_LEVELS] = {128, 259, 546, 964, 1529, 2248, 3126, 4095};
#define MENU_TIMEOUT_MS 10000

// Function definitions
void setup_user_leds();
void setup_user_btns();
void setup_rtc();
void setup_usb();
void settings_load();
void settings_save();
void update_leds();
void update_display_brightness();
void render();
void handle_input();
void begin_edit();
void adjust_field(int8_t delta);
void commit_edit();

// IRQ Handlers and Event Callbacks
void handleEvent(AceButton *, uint8_t, uint8_t);
void irq_rtc_seconds(void *data);
void irq_timer_led();

/**
 * Write content to the display.
 *
 * With the waveform replay running, content goes into the buffer and the refresh
 * picks it up; shifting and latching here as well would fight the replay and show
 * as a flick once a second. Without it, this is the shipping path unchanged.
 */
static inline void display_write(const char *buf, uint8_t dp)
{
#ifdef SHIFT_ENGINE_VERIFY
  if (wave_verify)
  {
    display.setContent(buf, dp);
    return;
  }
#endif
  display.writeDisplay(buf, dp);
  display.latch();
}

static inline bool blink_on()
{
  return ((millis() / BLINK_PERIOD_MS) % 2) == 0;
}

void setup()
{
  // analogWrite's resolution and frequency are global, shared by the indicator
  // LEDs on TIM4 and the display's ~OE on TIM2. Set once, here, before anything
  // uses them -- tuning one feature must not silently change the other.
  analogWriteResolution(PWM_BITS);
  analogWriteFrequency(PWM_FREQ_HZ);

  setup_rtc();
  setup_user_btns();
  setup_user_leds();

  settings_load();

  display.begin(0U, PWM_MAX_DUTY);
  update_display_brightness();

  setup_usb();
  Serial.dtr(true);
  Serial.begin();
  serial_commands_.SetDefaultHandler(cmd_unrecognized);
  serial_commands_.AddCommand(&cmd_test_);
  serial_commands_.AddCommand(&cmd_set_time_);
  serial_commands_.AddCommand(&cmd_get_time_);
  serial_commands_.AddCommand(&cmd_set_offset_);
  serial_commands_.AddCommand(&cmd_get_offset_);
  serial_commands_.AddCommand(&cmd_get_mode_);
  serial_commands_.AddCommand(&cmd_set_mode_);
  serial_commands_.AddCommand(&cmd_get_alarm_);
  serial_commands_.AddCommand(&cmd_set_alarm_);
  serial_commands_.AddCommand(&cmd_alarm_enable_);
  serial_commands_.AddCommand(&cmd_get_leds_);
  serial_commands_.AddCommand(&cmd_get_bright_);
  serial_commands_.AddCommand(&cmd_set_bright_);
  serial_commands_.AddCommand(&cmd_get_disp_);
  serial_commands_.AddCommand(&cmd_set_disp_);
  serial_commands_.AddCommand(&cmd_get_backup_);
#ifdef SHIFT_SWEEP
  serial_commands_.AddCommand(&cmd_set_nops_);
  serial_commands_.AddCommand(&cmd_set_pattern_);
#endif
#ifdef SHIFT_ENGINE_VERIFY
  serial_commands_.AddCommand(&cmd_wave_verify_);
  serial_commands_.AddCommand(&cmd_wave_level_);
  serial_commands_.AddCommand(&cmd_wave_dump_);
  serial_commands_.AddCommand(&cmd_wave_rate_);
#endif

  last_activity_ms = millis();

  Serial.println("Started");
}

void loop()
{
  // Check buttons
  btnSet.check();
  btnPlus.check();
  btnMinus.check();

  // Check Serial for input
  serial_commands_.ReadSerial();

  if (alarm_fire_request)
  {
    alarm_fire_request = false;
    stateMachine.execute(Action::ALARM_FIRE);
  }

  handle_input();

