gcoonrod/stm32-shift-display/firmware/src/main.cpp
  // Only re-shift and latch when something actually changed; the idle path
  // would otherwise re-shift six characters every pass of the loop.
  if (dp != last_rendered_dp || memcmp(buf, last_rendered, 6) != 0)
  {
    display_write(buf, dp);
    memcpy(last_rendered, buf, 6);
    last_rendered[6] = '\0';
    last_rendered_dp = dp;
  }
}

void begin_edit()
{
  edit_item = stateMachine.getMenuState();

  switch (edit_item)
  {
  case MENU_TIME:
    edit_field[0] = date_time_buf.hours;
    edit_field[1] = date_time_buf.minutes;
    edit_field[2] = date_time_buf.seconds;
    break;

  case MENU_DATE:
    edit_field[0] = date_time_buf.day;
    edit_field[1] = date_time_buf.month;
    edit_field[2] = date_time_buf.year;
    break;

  case MENU_MODE:
    edit_field[0] = settings.mode12 ? 1 : 0;
    break;

  case MENU_ALARM:
    edit_field[0] = settings.alarmHour;
    edit_field[1] = settings.alarmMinute;
    edit_field[2] = settings.alarmArmed ? 1 : 0;
    break;

  case MENU_BRIGHT:
    edit_field[0] = settings.indicatorLevel;
    break;

  case MENU_DISP:
    edit_field[0] = settings.displayLevel;
    break;

  default:
    break;
  }
}

// Inclusive limits for the field currently being edited.
static void field_limits(uint8_t field, uint8_t *lo, uint8_t *hi)
{
  *lo = 0;
  *hi = 0;

  switch (edit_item)
  {
  case MENU_TIME:
    *hi = (field == 0) ? 23 : 59;
    break;

  case MENU_DATE:
    if (field == 0)
    {
      *lo = 1;
      *hi = 31;
    }
    else if (field == 1)
    {
      *lo = 1;
      *hi = 12;
    }
    else
    {
      *hi = 99;
    }
    break;

  case MENU_MODE:
    *hi = 1;
    break;

  case MENU_ALARM:
    if (field == 0)
    {
      *hi = 23;
    }
    else if (field == 1)
    {
      *hi = 59;
    }
    else
    {
      *hi = 1;
    }
    break;

  case MENU_BRIGHT:
    *hi = LED_LEVELS - 1;
    break;

  case MENU_DISP:
    *hi = DISP_LEVELS - 1;
    break;

  default:
    break;
  }
}

void adjust_field(int8_t delta)
{
  uint8_t field = stateMachine.getField();
  if (field >= 3)
  {
    return;
  }

  uint8_t lo, hi;
  field_limits(field, &lo, &hi);
  if (hi <= lo)
  {
    return; // nothing adjustable for this field
  }

  int16_t value = (int16_t)edit_field[field] + delta;
  if (value > (int16_t)hi)
  {
    value = lo;
  }
  else if (value < (int16_t)lo)
  {
    value = hi;
  }

  edit_field[field] = (uint8_t)value;
}

void commit_edit()
{
  switch (edit_item)
  {
  case MENU_TIME:
    rtc.setHours(edit_field[0]);
    rtc.setMinutes(edit_field[1]);
    rtc.setSeconds(edit_field[2]);
    date_time_buf.hours = edit_field[0];
    date_time_buf.minutes = edit_field[1];
    date_time_buf.seconds = edit_field[2];
    break;

  case MENU_DATE:
    rtc.setDay(edit_field[0]);
    rtc.setMonth(edit_field[1]);
    rtc.setYear(edit_field[2]);
    date_time_buf.day = edit_field[0];
    date_time_buf.month = edit_field[1];
    date_time_buf.year = edit_field[2];
    break;

  case MENU_MODE:
    settings.mode12 = (edit_field[0] != 0);
    settings_save();
    break;

  case MENU_ALARM:
    settings.alarmHour = edit_field[0];
    settings.alarmMinute = edit_field[1];
    settings.alarmArmed = (edit_field[2] != 0);
    settings_save();
    break;

  case MENU_BRIGHT:
    settings.indicatorLevel = edit_field[0];
    settings_save();
    break;

  case MENU_DISP:
    settings.displayLevel = edit_field[0];
    settings_save();
    break;

  default:
    break;
  }

  edit_item = MENU_NONE;
}

void handle_input()
{
  bool anyButton = (btnSetState != ButtonState::UNCHANGED) ||
                   (btnPlusState != ButtonState::UNCHANGED) ||
                   (btnMinusState != ButtonState::UNCHANGED);

  if (anyButton)
  {
    last_activity_ms = millis();
  }

  // A firing alarm swallows the press that silences it, so dismissing does not
  // also drop the user into the menu.
  if (stateMachine.getState() == State::FIRING)
  {
    if (anyButton)
    {
      stateMachine.execute(Action::ALARM_DISMISS);
    }
    return;
  }

  switch (stateMachine.getState())
  {
  case State::IDLE:
    if (btnSetState == ButtonState::CLICKED)
    {
      stateMachine.execute(Action::MENU_ENTER);
    }
    break;

  case State::MENU:
    if (btnSetState == ButtonState::LONG_PRESSED)
    {
      stateMachine.execute(Action::MENU_EXIT);
    }
    else if (btnSetState == ButtonState::CLICKED)
    {
      begin_edit();
      stateMachine.execute(Action::MENU_SELECT);
    }
    else if (btnPlusState == ButtonState::CLICKED || btnPlusState == ButtonState::REPEATED)
    {
      stateMachine.execute(Action::MENU_UP);
    }
    else if (btnMinusState == ButtonState::CLICKED || btnMinusState == ButtonState::REPEATED)
    {
      stateMachine.execute(Action::MENU_DOWN);
    }
    break;

  case State::EDIT:
    if (btnSetState == ButtonState::LONG_PRESSED)
    {
      stateMachine.execute(Action::MENU_EXIT);
    }
    else if (btnSetState == ButtonState::CLICKED)
    {
      stateMachine.execute(Action::EDIT_NEXT);
    }
    else if (btnPlusState == ButtonState::CLICKED || btnPlusState == ButtonState::REPEATED)
    {
      adjust_field(1);
    }
    else if (btnMinusState == ButtonState::CLICKED || btnMinusState == ButtonState::REPEATED)
    {
      adjust_field(-1);
    }
    break;

  default:
    break;
  }
}

void handleEvent(AceButton *button, uint8_t eventType, uint8_t buttonState)
{
  UNUSED(buttonState);

  ButtonState mapped;
  switch (eventType)
  {
  case AceButton::kEventClicked:
    mapped = ButtonState::CLICKED;
    break;
  case AceButton::kEventLongPressed:
    mapped = ButtonState::LONG_PRESSED;
    break;
  case AceButton::kEventRepeatPressed:
    mapped = ButtonState::REPEATED;
    break;
  default:
    return;
  }

  ButtonState *slot;
  switch (button->getPin())
  {
  case BTN_SET:
    slot = &btnSetState;
    break;
  case BTN_PLUS:
    slot = &btnPlusState;
    break;
  case BTN_MINUS:
    slot = &btnMinusState;
    break;

  default:
    return;
  }

  // AceButton can emit more than one event for a button in a single check(),
  // and the loop only consumes one per pass. A long press is the intent the
  // user waited for, so it is never discarded by whatever follows it.
  if (*slot == ButtonState::LONG_PRESSED && mapped != ButtonState::LONG_PRESSED)
  {
    return;
  }

  *slot = mapped;
}

