gcoonrod/stm32-shift-display/firmware/src/main.cpp
// Unused: the hook intended for PWM brightness control on the 595 OE line.
// Nothing calls this yet -- see docs/DEVELOPMENT.md, "Unimplemented".
void irq_timer_led()
{
  if (output_en)
  {
    display.enable();
    output_en = false;
  }
  else
  {
    display.disable();
    output_en = true;
  }
}

void irq_rtc_seconds(void *data)
{
  UNUSED(data);

  // Update the clock buffer
  date_time_buf.year = rtc.getYear();
  date_time_buf.month = rtc.getMonth();
  date_time_buf.day = rtc.getDay();
  date_time_buf.week_day = rtc.getWeekDay();
  date_time_buf.hours = rtc.getHours();
  date_time_buf.minutes = rtc.getMinutes();
  date_time_buf.seconds = rtc.getSeconds();

  time_dirty = true;

  // Daily alarm. Matching on seconds == 0 means this is true for exactly one
  // tick per day, so it fires once and re-arms itself simply by the clock
  // coming round again -- no RTC alarm peripheral, and nothing to reschedule.
  if (settings.alarmArmed &&
      date_time_buf.seconds == 0 &&
      date_time_buf.hours == settings.alarmHour &&
      date_time_buf.minutes == settings.alarmMinute)
  {
    alarm_fire_request = true;
  }
}


/**
 * Print::print() has no zero-padding and no hex width, which is the only reason
 * these call sites reached for printf -- and Print::printf drags in vdprintf ->
 * vasnprintf -> svfprintf -> printf_i, about 2.7 KB, to format "%d" and "%s".
 * These three do what the eleven call sites actually needed.
 */
static void print2(Print *out, uint8_t value)
{
  if (value < 10)
  {
    out->print('0');
  }
  out->print(value);
}

static void print4hex(Print *out, uint32_t value)
{
  static const char digits[] = "0123456789ABCDEF";
  out->print(digits[(value >> 12) & 0xF]);
  out->print(digits[(value >> 8) & 0xF]);
  out->print(digits[(value >> 4) & 0xF]);
  out->print(digits[value & 0xF]);
}

// "ERROR <FIELD> OUT OF RANGE {<value>}: <raw>", with no trailing newline, which
// is what these replies have always looked like.
static void print_range_error(Print *out, const char *field, int value, const char *raw)
{
  out->print("ERROR ");
  out->print(field);
  out->print(" OUT OF RANGE {");
  out->print(value);
  out->print("}: ");
  out->print(raw);
}

void cmd_unrecognized(SerialCommands *sender, const char *cmd)
{
  sender->GetSerial()->print(F("Unrecognized command ["));
  sender->GetSerial()->print(cmd);
  sender->GetSerial()->println(F("]"));
}

void cmd_test(SerialCommands *sender)
{
  Serial.println("TEST");
}

void cmd_set_hour(SerialCommands *sender)
{
  char *hour_str = sender->Next();
  if (hour_str == NULL)
  {
    sender->GetSerial()->println("ERROR NO_HOUR");
    return;
  }

  int hour = atoi(hour_str);
  if (hour < 0 || hour >= 24)
  {
    print_range_error(sender->GetSerial(), "HOUR", hour, hour_str);
    return;
  }

  date_time_buf.hours = hour;
  rtc.setHours(hour);
}

void cmd_set_minute(SerialCommands *sender)
{
  char *m_str = sender->Next();
  if (m_str == NULL)
  {
    sender->GetSerial()->println("ERROR NO_MINUTE");
    return;
  }

  int m = atoi(m_str);
  if (m < 0 || m >= 60)
  {
    print_range_error(sender->GetSerial(), "MINUTE", m, m_str);
    return;
  }

  date_time_buf.minutes = m;
  rtc.setMinutes(m);
}

void cmd_set_second(SerialCommands *sender)
{
  char *second_str = sender->Next();
  if (second_str == NULL)
  {
    sender->GetSerial()->println("ERROR NO_SECOND");
    return;
  }

  int second = atoi(second_str);
  if (second < 0 || second >= 60)
  {
    print_range_error(sender->GetSerial(), "SECOND", second, second_str);
    return;
  }

  date_time_buf.seconds = second;
  rtc.setSeconds(second);
}

/**
 * Civil-date arithmetic, replacing localtime() and mktime().
 *
 * Those two cost about 5.2 KB between them, and almost none of it is date
 * maths: localtime reaches tzset, which reaches sscanf to parse a TZ string
 * this firmware never sets, which drags in the whole formatted-input engine.
 * The conversion itself is two well-known integer routines over the proleptic
 * Gregorian calendar -- no tables, no locale, no timezone database.
 *
 * Days are counted from 1970-01-01. Month is 1..12 here and everywhere else;
 * see cmd_set_time for why that used to be 0..11 on this path alone.
 */
static int32_t days_from_civil(int32_t y, uint8_t m, uint8_t d)
{
  y -= (m <= 2);
  int32_t era = (y >= 0 ? y : y - 399) / 400;
  uint32_t yoe = (uint32_t)(y - era * 400);
  uint32_t doy = (153U * (m + (m > 2 ? -3 : 9)) + 2U) / 5U + d - 1U;
  uint32_t doe = yoe * 365U + yoe / 4U - yoe / 100U + doy;
  return era * 146097 + (int32_t)doe - 719468;
}

static void civil_from_days(int32_t z, int32_t *y, uint8_t *m, uint8_t *d)
{
  z += 719468;
  int32_t era = (z >= 0 ? z : z - 146096) / 146097;
  uint32_t doe = (uint32_t)(z - era * 146097);
  uint32_t yoe = (doe - doe / 1460U + doe / 36524U - doe / 146096U) / 365U;
  int32_t yr = (int32_t)yoe + era * 400;
  uint32_t doy = doe - (365U * yoe + yoe / 4U - yoe / 100U);
  uint32_t mp = (5U * doy + 2U) / 153U;
  *d = (uint8_t)(doy - (153U * mp + 2U) / 5U + 1U);
  *m = (uint8_t)(mp + (mp < 10U ? 3U : -9U));
  *y = yr + (*m <= 2);
}

typedef struct
{
  int32_t year;   // full year, e.g. 2026
  uint8_t month;  // 1..12
  uint8_t day;
  uint8_t hours;
  uint8_t minutes;
  uint8_t seconds;
} CivilTime_t;

static void civil_from_timestamp(int32_t ts, CivilTime_t *out)
{
  int32_t days = ts / 86400;
  int32_t rem = ts % 86400;
  if (rem < 0)
  {
    rem += 86400;
    days -= 1;
  }

  civil_from_days(days, &out->year, &out->month, &out->day);
  out->hours = (uint8_t)(rem / 3600);
  out->minutes = (uint8_t)((rem % 3600) / 60);
  out->seconds = (uint8_t)(rem % 60);
}

// Returned 64-bit to match what mktime produced here: time_t is 64 bits in this
// toolchain, and an out-of-range date can exceed 32 bits -- GT printed exactly
// such a value before this change, and still must.
static int64_t timestamp_from_civil(const CivilTime_t *t)
{
  return (int64_t)days_from_civil(t->year, t->month, t->day) * 86400LL +
         (int64_t)t->hours * 3600LL + (int64_t)t->minutes * 60LL + t->seconds;
}

void cmd_set_time(SerialCommands *sender)
{
  char *timestampStr = sender->Next();
  if (timestampStr == NULL)
  {
    sender->GetSerial()->println("ERROR NO_TIMESTAMP");
    return;
  }

  int32_t timestamp = (int32_t)atol(timestampStr);
  timestamp += timezoneOffset * 60 * 60;

  CivilTime_t t;
  civil_from_timestamp(timestamp, &t);

