gcoonrod/stm32-shift-display/firmware/src/main.cpp
  // Month is stored 1..12, matching the RTC and the menu editor. It used to be
  // stored 0..11 on this path only; ST and GT still round-tripped because the
  // same offset was applied on both sides, so the disagreement only showed
  // between the serial and menu paths.
  date_time_buf.hours = t.hours;
  date_time_buf.minutes = t.minutes;
  date_time_buf.seconds = t.seconds;
  date_time_buf.day = t.day;
  date_time_buf.month = t.month;
  date_time_buf.year = (uint8_t)(t.year - 2000);

  rtc.setHours(t.hours);
  rtc.setMinutes(t.minutes);
  rtc.setSeconds(t.seconds);
  rtc.setDay(t.day);
  rtc.setMonth(t.month);
  rtc.setYear((uint8_t)(t.year - 2000));

  sender->GetSerial()->println("OK");
}

void cmd_get_time(SerialCommands *sender)
{

  CivilTime_t t;
  t.year = 2000 + date_time_buf.year;
  t.month = date_time_buf.month;
  t.day = date_time_buf.day;
  t.hours = date_time_buf.hours;
  t.minutes = date_time_buf.minutes;
  t.seconds = date_time_buf.seconds;

  int64_t timestamp = timestamp_from_civil(&t);

  // Apply the timezone offset to change the time to UTC
  timestamp -= (int64_t)timezoneOffset * 60 * 60;

  // Return the current time as a Unix timestamp
  sender->GetSerial()->println((long long)timestamp);
}

void cmd_set_offset(SerialCommands *sender)
{
  char *offsetStr = sender->Next();
  if (offsetStr == NULL)
  {
    sender->GetSerial()->println("ERROR NO_OFFSET");
    return;
  }

  int offset = atoi(offsetStr);
  timezoneOffset = offset;
  sender->GetSerial()->println("OK");
}

void cmd_get_offset(SerialCommands *sender)
{
  sender->GetSerial()->println(timezoneOffset);
}
void cmd_get_mode(SerialCommands *sender)
{
  sender->GetSerial()->println(settings.mode12 ? 12 : 24);
}

void cmd_set_mode(SerialCommands *sender)
{
  char *mode_str = sender->Next();
  if (mode_str == NULL)
  {
    sender->GetSerial()->println("ERROR NO_MODE");
    return;
  }

  int mode = atoi(mode_str);
  if (mode != 12 && mode != 24)
  {
    print_range_error(sender->GetSerial(), "MODE", mode, mode_str);
    return;
  }

  settings.mode12 = (mode == 12);
  settings_save();
  sender->GetSerial()->println("OK");
}

void cmd_get_alarm(SerialCommands *sender)
{
  // "<hh> <mm> <armed>"
  Print *out = sender->GetSerial();
  print2(out, settings.alarmHour);
  out->print(' ');
  print2(out, settings.alarmMinute);
  out->print(' ');
  out->println(settings.alarmArmed ? 1 : 0);
}

void cmd_set_alarm(SerialCommands *sender)
{
  char *hour_str = sender->Next();
  if (hour_str == NULL)
  {
    sender->GetSerial()->println("ERROR NO_HOUR");
    return;
  }

  char *minute_str = sender->Next();
  if (minute_str == NULL)
  {
    sender->GetSerial()->println("ERROR NO_MINUTE");
    return;
  }

  int hour = atoi(hour_str);
  if (hour < 0 || hour >= 24)
  {
    print_range_error(sender->GetSerial(), "HOUR", hour, hour_str);
    return;
  }

  int minute = atoi(minute_str);
  if (minute < 0 || minute >= 60)
  {
    print_range_error(sender->GetSerial(), "MINUTE", minute, minute_str);
    return;
  }

  settings.alarmHour = hour;
  settings.alarmMinute = minute;
  settings_save();
  sender->GetSerial()->println("OK");
}

void cmd_alarm_enable(SerialCommands *sender)
{
  char *enable_str = sender->Next();
  if (enable_str == NULL)
  {
    sender->GetSerial()->println("ERROR NO_STATE");
    return;
  }

  int enable = atoi(enable_str);
  if (enable != 0 && enable != 1)
  {
    print_range_error(sender->GetSerial(), "STATE", enable, enable_str);
    return;
  }

  settings.alarmArmed = (enable == 1);
  settings_save();

  // Disarming silences a firing alarm too. Without this the only way out of the
  // firing state is a button press, which leaves no way to stop it from a host.
  if (!settings.alarmArmed && stateMachine.getState() == State::FIRING)
  {
    stateMachine.execute(Action::ALARM_DISMISS);
  }

  sender->GetSerial()->println("OK");
}

void cmd_get_disp(SerialCommands *sender)
{
  // "<level> <duty>" -- the duty makes the active-low inversion checkable from a
  // host: a low level must read a low duty, not a high one.
  Print *out = sender->GetSerial();
  out->print(settings.displayLevel + 1);
  out->print(' ');
  out->println(disp_gamma[effective_display_level()]);
}

void cmd_set_disp(SerialCommands *sender)
{
  char *level_str = sender->Next();
  if (level_str == NULL)
  {
    sender->GetSerial()->println("ERROR NO_LEVEL");
    return;
  }

  int level = atoi(level_str);
  if (level < 1 || level > DISP_LEVELS)
  {
    print_range_error(sender->GetSerial(), "LEVEL", level, level_str);
    return;
  }

  settings.displayLevel = level - 1;
  settings_save();
  sender->GetSerial()->println("OK");
}

void cmd_get_backup(SerialCommands *sender)
{
  // "boot:<magic> <flags> <alarm> <bright>  now:<magic> <flags> <alarm> <bright>"
  // The boot values are what settings_load() saw; the now values are what the
  // registers hold at this moment.
  Print *out = sender->GetSerial();
  out->print("boot:");
  print4hex(out, boot_magic_seen);
  out->print(' ');
  print4hex(out, boot_flags_seen);
  out->print(' ');
  print4hex(out, boot_alarm_seen);
  out->print(' ');
  print4hex(out, boot_bright_seen);
  out->print(" now:");
  print4hex(out, getBackupRegister(BKP_MAGIC_REG));
  out->print(' ');
  print4hex(out, getBackupRegister(BKP_FLAGS_REG));
  out->print(' ');
  print4hex(out, getBackupRegister(BKP_ALARM_REG));
  out->print(' ');
  print4hex(out, getBackupRegister(BKP_BRIGHT_REG));
  out->print(" expect_magic:");
  print4hex(out, BKP_MAGIC_VALUE);
  out->println();
}

#ifdef SHIFT_ENGINE_VERIFY
void cmd_wave_verify(SerialCommands *sender)
{
  char *arg = sender->Next();
  Stream *out = sender->GetSerial();

  if (arg == NULL)
  {
    out->print("wave=");
    out->println(wave_verify ? 1 : 0);
    return;
  }

  wave_verify = (atoi(arg) != 0);

  if (!wave_verify)
  {
    // Leaving replay: put the shipping path back in charge of what is latched.
    time_dirty = true;
  }

  out->print("wave=");
  out->println(wave_verify ? 1 : 0);
}

void cmd_wave_level(SerialCommands *sender)
{
  Stream *out = sender->GetSerial();
  char *pos_arg = sender->Next();

