gcoonrod/stm32-shift-display/firmware/src/main.cpp
  if (pos_arg == NULL)
  {
    for (uint8_t i = 0; i < 6; i++)
    {
      out->print(display.getDigitLevel(i));
      out->print(i == 5 ? '\n' : ' ');
    }
    return;
  }

  char *lvl_arg = sender->Next();
  if (lvl_arg == NULL)
  {
    out->println("ERROR NO_LEVEL");
    return;
  }

  int pos = atoi(pos_arg);
  int lvl = atoi(lvl_arg);

  if (pos < 0 || pos > 5)
  {
    out->print("ERROR POS OUT OF RANGE: ");
    out->println(pos_arg);
    return;
  }

  if (lvl < 0 || lvl > (int)ShiftDisplay::maxDigitLevel())
  {
    out->print("ERROR LEVEL OUT OF RANGE: ");
    out->println(lvl_arg);
    return;
  }

  display.setDigitLevel((uint8_t)pos, (uint8_t)lvl);
  out->println("OK");
}

/**
 * Measure what the CPU replay actually achieves, flat out.
 *
 * The replay turned out not to flicker, which the proposal did not expect, so
 * the rate it reaches is worth a number rather than an inference. It also sets
 * the honest terms for what DMA buys: not "the CPU cannot do this" but "the CPU
 * need not spend itself doing it".
 *
 * Blocks the loop for the duration. It is a measurement in a test build.
 */
void cmd_wave_rate(SerialCommands *sender)
{
  Stream *out = sender->GetSerial();
  const uint16_t FRAMES = 200;

  uint32_t t0 = micros();
  for (uint16_t f = 0; f < FRAMES; f++)
  {
    for (uint8_t s = 0; s < ShiftDisplay::maxDigitLevel(); s++)
    {
      display.shiftSliceByHand(s);
    }
  }
  uint32_t dt = micros() - t0;

  if (dt == 0)
  {
    out->println("ERROR NO_ELAPSED");
    return;
  }

  uint32_t frame_hz = (uint32_t)((uint64_t)FRAMES * 1000000ULL / dt);
  uint32_t bits = (uint32_t)FRAMES * ShiftDisplay::maxDigitLevel() * SHIFT_ENGINE_BITS_PER_SLICE;
  uint32_t bit_hz = (uint32_t)((uint64_t)bits * 1000000ULL / dt);

  out->print("frames=");
  out->print(FRAMES);
  out->print(" us=");
  out->print(dt);
  out->print(" frame_hz=");
  out->print(frame_hz);
  out->print(" bit_hz=");
  out->print(bit_hz);
  out->print(" target_frame_hz=");
  out->print(SHIFT_ENGINE_FRAME_HZ);
  out->print(" target_bit_hz=");
  out->println(SHIFT_ENGINE_BIT_CLOCK_HZ);
}

void cmd_wave_dump(SerialCommands *sender)
{
  Stream *out = sender->GetSerial();

  out->print("slices=");
  out->print(SHIFT_ENGINE_SLICES);
  out->print(" words/slice=");
  out->print(SHIFT_ENGINE_WORDS_PER_SLICE);
  out->print(" bytes=");
  out->print(SHIFT_ENGINE_BUFFER_BYTES);
  out->print(" arr=");
  out->print(SHIFT_ENGINE_ARR);
  out->print(" ccr=");
  out->print(SHIFT_ENGINE_CCR_CLOCK);
  out->print(" bitclk=");
  out->print(SHIFT_ENGINE_BIT_CLOCK_HZ);
  out->print(" frame=");
  out->print(SHIFT_ENGINE_FRAME_HZ);
  out->print(" capable=");
  out->print(display.engineCapable() ? 1 : 0);
  out->print(" clkok=");
  out->print(shift_engine_clock_ok() ? 1 : 0);
  out->print(" coreclk=");
  out->print(SystemCoreClock);
  out->print(" assumed=");
  out->println((uint32_t)SHIFT_ENGINE_CORE_CLOCK_HZ);

  // The first four words of slice 0: enough to see the latch pulse riding in
  // words 0 and 1, and that no word touches the ~OE bit.
  const uint32_t *w = display.waveform();
  for (uint8_t i = 0; i < 4; i++)
  {
    out->print("w");
    out->print(i);
    out->print("=");
    print4hex(out, (uint16_t)(w[i] >> 16));
    print4hex(out, (uint16_t)(w[i] & 0xFFFF));
    out->print(i == 3 ? '\n' : ' ');
  }
}
#endif

#ifdef SHIFT_SWEEP
void cmd_set_nops(SerialCommands *sender)
{
  char *arg = sender->Next();
  if (arg == NULL)
  {
    sender->GetSerial()->print("nops=");
    sender->GetSerial()->println(shift_edge_nops);
    return;
  }
  shift_edge_nops = (uint8_t)atoi(arg);
  sender->GetSerial()->print("nops=");
  sender->GetSerial()->println(shift_edge_nops);
}

void cmd_set_pattern(SerialCommands *sender)
{
  char *arg = sender->Next();
  if (arg == NULL)
  {
    sender->GetSerial()->print("pattern=");
    sender->GetSerial()->println(test_pattern);
    return;
  }
  test_pattern = (uint8_t)atoi(arg);
  last_rendered[0] = '\0'; // force a redraw
  sender->GetSerial()->print("pattern=");
  sender->GetSerial()->println(test_pattern);
}
#endif

void cmd_get_leds(SerialCommands *sender)
{
  // "<top> <mid> <bot>" as duty values, 0-255. Lit means non-zero. Reporting
  // duty rather than a logical level keeps a breathing alarm observable from a
  // host, and digitalRead() is no longer meaningful here anyway: on a pin the
  // timer is driving it samples the live PWM waveform at an arbitrary phase.
  Print *out = sender->GetSerial();
  out->print(led_duty[0]);
  out->print(' ');
  out->print(led_duty[1]);
  out->print(' ');
  out->println(led_duty[2]);
}

void cmd_get_bright(SerialCommands *sender)
{
  sender->GetSerial()->println(settings.indicatorLevel + 1);
}

void cmd_set_bright(SerialCommands *sender)
{
  char *level_str = sender->Next();
  if (level_str == NULL)
  {
    sender->GetSerial()->println("ERROR NO_LEVEL");
    return;
  }

  int level = atoi(level_str);
  if (level < 1 || level > LED_LEVELS)
  {
    print_range_error(sender->GetSerial(), "LEVEL", level, level_str);
    return;
  }

  settings.indicatorLevel = level - 1;
  settings_save();
  sender->GetSerial()->println("OK");
}
